// Дана последовательность температурных колебаний 
// (-25.4, -27.0 13.0, 19.0, 15.5, 24.5, -21.0, 32.5)
// . Объединить данный значения в группы с шагов в 10 
// градусов. Последовательность в подмножностве не важна.
// Пример: (-20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc)

package main
import (
	"fmt"
)
func separator(arr []float32) map[int][]float32 {
	
	m1 := make(map[int][]float32)
	for i := range arr {
		j := int(arr[i]) / 10
		m1[j * 10] = append(m1[j * 10], arr[i])
	}
	return m1
}
func main() {
	arr := []float32 {-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5, -11.3, -14.0, 5.3, 6.2, -6.6, -7.3}
	fmt.Printf("прогноз погоды %v\n", arr)
	m1 := separator(arr)
	fmt.Println(m1)
}